Show / Hide Table of Contents
Class BendData
Provides data of bend
Inheritance
System.Object
BendData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class BendData
Properties
Improve this Doc   View Source
EndFaceNormal1
End Face Normal vector
Declaration
public Vector3D EndFaceNormal1 { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Plate1Id
First plate
Declaration
public int Plate1Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Plate2Id
Second plate
Declaration
public int Plate2Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Point1OfSideBoundary1
Side boundary first plate point 1
Declaration
public Point3D Point1OfSideBoundary1 { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Point1OfSideBoundary2
Side boundary second plate point 1
Declaration
public Point3D Point1OfSideBoundary2 { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Point2OfSideBoundary1
Side boundary first plate point 2
Declaration
public Point3D Point2OfSideBoundary1 { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Point2OfSideBoundary2
Side boundary second plate point 2
Declaration
public Point3D Point2OfSideBoundary2 { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Radius
Radius of bend
Declaration
public double Radius { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source